[MID_UNKNOWN]
[English]
Unspecified
[French]
Non indiqué
[Russian]
Вез определения

[MID_KEY_Pad1][English]
[MID_KEY_Pad2][English]
[MID_KEY_Pad3][English]
[MID_KEY_Pad4][English]
[MID_KEY_Pad5][English]
[MID_KEY_Pad6][English]
[MID_KEY_Pad7][English]

[MID_KEY_BACKSPACE]
[English]
Backspace
[French]
Espace arrière
[Russian]
Стереть

[MID_KEY_TAB]
[English]
Tab
[French]
Tabulation
[Russian]
"Tab"

[MID_KEY_Pad10][English]
[MID_KEY_Pad11][English]
[MID_KEY_Pad12][English]

[MID_KEY_RETURN]
[English]
Enter
[French]
Entrée
[Russian]
"Enter"

[MID_KEY_Pad14][English]
[MID_KEY_Pad15][English]
[MID_KEY_Pad16][English]
[MID_KEY_Pad17][English]
[MID_KEY_Pad18][English]
[MID_KEY_Pad19][English]
[MID_KEY_Pad20][English]
[MID_KEY_Pad21][English]
[MID_KEY_Pad22][English]
[MID_KEY_Pad23][English]
[MID_KEY_Pad24][English]
[MID_KEY_Pad25][English]
[MID_KEY_Pad26][English]
[MID_KEY_Pad27][English]
[MID_KEY_Pad28][English]
[MID_KEY_Pad29][English]
[MID_KEY_Pad30][English]
[MID_KEY_Pad31][English]

[MID_KEY_SPACE]
[English]
Space
[French]
Espace
[Russian]
Пробель

[MID_KEY_EXCLAIM]
[English]
!

[MID_KEY_Pad34][English]

[MID_KEY_HASH]
[English]
#

[MID_KEY_DOLLAR]
[English]
$

[MID_KEY_Pad37][English]

[MID_KEY_AMPERSAND]
[English]
&

[MID_KEY_QUOTE]
[English]
'

[MID_KEY_LEFTPAREN]
[English]
(

[MID_KEY_RIGHTPAREN]
[English]
)

[MID_KEY_ASTERISK]
[English]
*

[MID_KEY_PLUS]
[English]
+

[MID_KEY_COMMA]
[English]
,

[MID_KEY_MINUS]
[English]
-

[MID_KEY_PERIOD]
[English]
.

[MID_KEY_SLASH]
[English]
/

[MID_KEY_0]
[English]
0

[MID_KEY_1]
[English]
1

[MID_KEY_2]
[English]
2

[MID_KEY_3]
[English]
3

[MID_KEY_4]
[English]
4

[MID_KEY_5]
[English]
5

[MID_KEY_6]
[English]
6

[MID_KEY_7]
[English]
7

[MID_KEY_8]
[English]
8

[MID_KEY_9]
[English]
9

[MID_KEY_COLON]
[English]
:

[MID_KEY_SEMICOLON]
[English]
;

[MID_KEY_LESS]
[English]
<

[MID_KEY_EQUALS]
[English]
=

[MID_KEY_GREATER]
[English]
>

[MID_KEY_QUESTION]
[English]
?

[MID_KEY_AT]
[English]
@

[MID_KEY_Pad65][English]
[MID_KEY_Pad66][English]
[MID_KEY_Pad67][English]
[MID_KEY_Pad68][English]
[MID_KEY_Pad69][English]
[MID_KEY_Pad70][English]
[MID_KEY_Pad71][English]
[MID_KEY_Pad72][English]
[MID_KEY_Pad73][English]
[MID_KEY_Pad74][English]
[MID_KEY_Pad75][English]
[MID_KEY_Pad76][English]
[MID_KEY_Pad77][English]
[MID_KEY_Pad78][English]
[MID_KEY_Pad79][English]
[MID_KEY_Pad80][English]
[MID_KEY_Pad81][English]
[MID_KEY_Pad82][English]
[MID_KEY_Pad83][English]
[MID_KEY_Pad84][English]
[MID_KEY_Pad85][English]
[MID_KEY_Pad86][English]
[MID_KEY_Pad87][English]
[MID_KEY_Pad88][English]
[MID_KEY_Pad89][English]
[MID_KEY_Pad90][English]

[MID_KEY_LEFTBRACKET]
[English]
[[

[MID_KEY_BACKSLASH]
[English]
\

[MID_KEY_RIGHTBRACKET]
[English]
]]

[MID_KEY_CARET]
[English]
^

[MID_KEY_UNDERSCORE]
[English]
_

[MID_KEY_BACKQUOTE]
[English]
`

[MID_KEY_a]
[English]
A

[MID_KEY_b]
[English]
B

[MID_KEY_c]
[English]
C

[MID_KEY_d]
[English]
D

[MID_KEY_e]
[English]
E

[MID_KEY_f]
[English]
F

[MID_KEY_g]
[English]
G

[MID_KEY_h]
[English]
H

[MID_KEY_i]
[English]
I

[MID_KEY_j]
[English]
J

[MID_KEY_k]
[English]
K

[MID_KEY_l]
[English]
L

[MID_KEY_m]
[English]
M

[MID_KEY_n]
[English]
N

[MID_KEY_o]
[English]
O

[MID_KEY_p]
[English]
P

[MID_KEY_q]
[English]
Q

[MID_KEY_r]
[English]
R

[MID_KEY_s]
[English]
S

[MID_KEY_t]
[English]
T

[MID_KEY_u]
[English]
U

[MID_KEY_v]
[English]
V

[MID_KEY_w]
[English]
W

[MID_KEY_x]
[English]
X

[MID_KEY_y]
[English]
Y

[MID_KEY_z]
[English]
Z

[MID_KEY_Pad123][English]
[MID_KEY_Pad124][English]
[MID_KEY_Pad125][English]
[MID_KEY_Pad126][English]

[MID_KEY_DELETE]
[English]
Delete
[French]
Supprimer
[Russian]
"Delete"

[MID_KEY_Pad128][English]
[MID_KEY_Pad129][English]
[MID_KEY_Pad130][English]
[MID_KEY_Pad131][English]
[MID_KEY_Pad132][English]
[MID_KEY_Pad133][English]
[MID_KEY_Pad134][English]
[MID_KEY_Pad135][English]
[MID_KEY_Pad136][English]
[MID_KEY_Pad137][English]
[MID_KEY_Pad138][English]
[MID_KEY_Pad139][English]
[MID_KEY_Pad140][English]
[MID_KEY_Pad141][English]
[MID_KEY_Pad142][English]
[MID_KEY_Pad143][English]
[MID_KEY_Pad144][English]
[MID_KEY_Pad145][English]
[MID_KEY_Pad146][English]
[MID_KEY_Pad147][English]
[MID_KEY_Pad148][English]
[MID_KEY_Pad149][English]
[MID_KEY_Pad150][English]
[MID_KEY_Pad151][English]
[MID_KEY_Pad152][English]
[MID_KEY_Pad153][English]
[MID_KEY_Pad154][English]
[MID_KEY_Pad155][English]
[MID_KEY_Pad156][English]
[MID_KEY_Pad157][English]
[MID_KEY_Pad158][English]
[MID_KEY_Pad159][English]
[MID_KEY_Pad160][English]
[MID_KEY_Pad161][English]
[MID_KEY_Pad162][English]
[MID_KEY_Pad163][English]
[MID_KEY_Pad164][English]
[MID_KEY_Pad165][English]
[MID_KEY_Pad166][English]
[MID_KEY_Pad167][English]
[MID_KEY_Pad168][English]
[MID_KEY_Pad169][English]
[MID_KEY_Pad170][English]
[MID_KEY_Pad171][English]
[MID_KEY_Pad172][English]
[MID_KEY_Pad173][English]
[MID_KEY_Pad174][English]
[MID_KEY_Pad175][English]
[MID_KEY_Pad176][English]
[MID_KEY_Pad177][English]
[MID_KEY_Pad178][English]
[MID_KEY_Pad179][English]
[MID_KEY_Pad180][English]
[MID_KEY_Pad181][English]
[MID_KEY_Pad182][English]
[MID_KEY_Pad183][English]
[MID_KEY_Pad184][English]
[MID_KEY_Pad185][English]
[MID_KEY_Pad186][English]
[MID_KEY_Pad187][English]
[MID_KEY_Pad188][English]
[MID_KEY_Pad189][English]
[MID_KEY_Pad190][English]
[MID_KEY_Pad191][English]
[MID_KEY_Pad192][English]
[MID_KEY_Pad193][English]
[MID_KEY_Pad194][English]
[MID_KEY_Pad195][English]
[MID_KEY_Pad196][English]
[MID_KEY_Pad197][English]
[MID_KEY_Pad198][English]
[MID_KEY_Pad199][English]
[MID_KEY_Pad200][English]
[MID_KEY_Pad201][English]
[MID_KEY_Pad202][English]
[MID_KEY_Pad203][English]
[MID_KEY_Pad204][English]
[MID_KEY_Pad205][English]
[MID_KEY_Pad206][English]
[MID_KEY_Pad207][English]
[MID_KEY_Pad208][English]
[MID_KEY_Pad209][English]
[MID_KEY_Pad210][English]
[MID_KEY_Pad211][English]
[MID_KEY_Pad212][English]
[MID_KEY_Pad213][English]
[MID_KEY_Pad214][English]
[MID_KEY_Pad215][English]
[MID_KEY_Pad216][English]
[MID_KEY_Pad217][English]
[MID_KEY_Pad218][English]
[MID_KEY_Pad219][English]
[MID_KEY_Pad220][English]
[MID_KEY_Pad221][English]
[MID_KEY_Pad222][English]
[MID_KEY_Pad223][English]
[MID_KEY_Pad224][English]
[MID_KEY_Pad225][English]
[MID_KEY_Pad226][English]
[MID_KEY_Pad227][English]
[MID_KEY_Pad228][English]
[MID_KEY_Pad229][English]
[MID_KEY_Pad230][English]
[MID_KEY_Pad231][English]
[MID_KEY_Pad232][English]
[MID_KEY_Pad233][English]
[MID_KEY_Pad234][English]
[MID_KEY_Pad235][English]
[MID_KEY_Pad236][English]
[MID_KEY_Pad237][English]
[MID_KEY_Pad238][English]
[MID_KEY_Pad239][English]
[MID_KEY_Pad240][English]
[MID_KEY_Pad241][English]
[MID_KEY_Pad242][English]
[MID_KEY_Pad243][English]
[MID_KEY_Pad244][English]
[MID_KEY_Pad245][English]
[MID_KEY_Pad246][English]
[MID_KEY_Pad247][English]
[MID_KEY_Pad248][English]
[MID_KEY_Pad249][English]
[MID_KEY_Pad250][English]
[MID_KEY_Pad251][English]
[MID_KEY_Pad252][English]
[MID_KEY_Pad253][English]
[MID_KEY_Pad254][English]
[MID_KEY_Pad255][English]

[MID_KEY_KP0]
[English]
0 (Keypad)
[French]
0 (Pavé numérique)
[Russian]
0 (вспомогательная клавиатура)

[MID_KEY_KP1]
[English]
1 (Keypad)
[French]
1 (Pavé numérique)
[Russian]
1 (вспомогательная клавиатура)

[MID_KEY_KP2]
[English]
2 (Keypad)
[French]
2 (Pavé numérique)
[Russian]
2 (вспомогательная клавиатура)

[MID_KEY_KP3]
[English]
3 (Keypad)
[French]
3 (Pavé numérique)
[Russian]
3 (вспомогательная клавиатура)

[MID_KEY_KP4]
[English]
4 (Keypad)
[French]
4 (Pavé numérique)
[Russian]
4 (вспомогательная клавиатура)

[MID_KEY_KP5]
[English]
5 (Keypad)
[French]
5 (Pavé numérique)
[Russian]
5 (вспомогательная клавиатура)

[MID_KEY_KP6]
[English]
6 (Keypad)
[French]
6 (Pavé numérique)
[Russian]
6 (вспомогательная клавиатура)

[MID_KEY_KP7]
[English]
7 (Keypad)
[French]
7 (Pavé numérique)
[Russian]
7 (вспомогательная клавиатура)

[MID_KEY_KP8]
[English]
8 (Keypad)
[French]
8 (Pavé numérique)
[Russian]
8 (вспомогательная клавиатура)

[MID_KEY_KP9]
[English]
9 (Keypad)
[French]
9 (Pavé numérique)
[Russian]
9 (вспомогательная клавиатура)

[MID_KEY_KP_PERIOD]
[English]
. (Keypad)
[French]
. (Pavé numérique)
[Russian]
. (вспомогательная клавиатура)

[MID_KEY_KP_DIVIDE]
[English]
/ (Keypad)
[French]
/ (Pavé numérique)
[Russian]
/ (вспомогательная клавиатура)

[MID_KEY_KP_MULTIPLY]
[English]
* (Keypad)
[French]
* (Pavé numérique)
[Russian]
* (вспомогательная клавиатура)

[MID_KEY_KP_MINUS]
[English]
- (Keypad)
[French]
- (Pavé numérique)
[Russian]
- (вспомогательная клавиатура)

[MID_KEY_KP_PLUS]
[English]
+ (Keypad)
[French]
+ (Pavé numérique)
[Russian]
+ (вспомогательная клавиатура)

[MID_KEY_KP_ENTER]
[English]
Enter (keypad)
[French]
Entrée (Pavé numérique)
[Russian]
"Enter" (вспомогательная клавиатура)

[MID_KEY_KP_EQUALS]
[English]
= (keypad)
[French]
= (Pavé numérique)
[Russian]
= (вспомогательная клавиатура)

[MID_KEY_UP]
[English]
Up
[French]
Haut
[Russian]
Вверх

[MID_KEY_DOWN]
[English]
Down
[French]
Bas
[Russian]
Вниз

[MID_KEY_RIGHT]
[English]
Right
[French]
Droite
[Russian]
В право

[MID_KEY_LEFT]
[English]
Left
[French]
Gauche
В лево

[MID_KEY_INSERT]
[English]
Insert
[French]
Insére
[Russian]
"Insert"

[MID_KEY_HOME]
[English]
Home
[French]
Maison
[Russian]
"Home"

[MID_KEY_END]
[English]
End
[French]
Fin
[Russian]
"End"

[MID_KEY_PAGEUP]
[English]
PageUp
[French]
Page suivante
[Russian]
"Page Up"

[MID_KEY_PAGEDOWN]
[English]
PageDown
[French]
Page précédente
[Russian]
"Page Down"

[MID_KEY_F1]
[English]
F1
[French]
F1
[Russian]
F1

[MID_KEY_F2]
[English]
F2
[French]
F2
[Russian]
F2

[MID_KEY_F3]
[English]
F3
[French]
F3
[Russian]
F3

[MID_KEY_F4]
[English]
F4
[French]
F4
[Russian]
F4

[MID_KEY_F5]
[English]
F5
[French]
F5
[Russian]
F5

[MID_KEY_F6]
[English]
F6
[French]
F6
[Russian]
F6

[MID_KEY_F7]
[English]
F7
[French]
F7
[Russian]
F7

[MID_KEY_F8]
[English]
F8
[French]
F8
[Russian]
F8

[MID_KEY_F9]
[English]
F9
[French]
F9
[Russian]
F9

[MID_KEY_F10]
[English]
F10
[French]
F10
[Russian]
F10

[MID_KEY_F11]
[English]
F11
[French]
F11
[Russian]
F11

[MID_KEY_F12]
[English]
F12
[French]
F12
[Russian]
F12

[MID_KEY_F13]
[English]
F13
[French]
F13
[Russian]
F13

[MID_KEY_F14]
[English]
F14
[French]
F14
[Russian]
F14

[MID_KEY_F15]
[English]
F15
[French]
F15
[Russian]
F15

[MID_KEY_Pad297][English]
[MID_KEY_Pad298][English]
[MID_KEY_Pad299][English]

[MID_KEY_NUMLOCK]
[English]
Num Lock
[French]
Num Lock!!translate
[Russian]
"Num Lock"

[MID_KEY_CAPSLOCK]
[English]
Caps Lock
[French]
Caps Lock!!translate
[Russian]
"Caps Lock"

[MID_KEY_SCROLLOCK]
[English]
Scroll Lock
[French]
Scroll Lock!!translate
[Russian]
"Scroll Lock"

[MID_KEY_RSHIFT]
[English]
Right Shift
[French]
Right Shift!!translate
[Russian]
"Right Shift"

[MID_KEY_LSHIFT]
[English]
Left Shift
[French]
Left Shift!!translate
[Russian]
"Left Shift"

[MID_KEY_RCTRL]
[English]
Right Ctrl
[French]
Right Ctrl!!translate
[Russian]
"Right Ctrl"

[MID_KEY_LCTRL]
[English]
Left Ctrl
[French]
Left Ctrl!!translate
[Russian]
"Left Ctrl"

[MID_KEY_RALT]
[English]
Right Alt
[French]
Right Alt!!translate
[Russian]
"Right Alt"

[MID_KEY_LALT]
[English]
Left Alt
[French]
Left Alt!!translate
[Russian]
"Left Alt"

[MID_KEY_RMETA]
[English]
Right Meta
[French]
Right Meta!!translate
[Russian]
"Right Meta"

[MID_KEY_LMETA]
[English]
Left Meta
[French]
Left Meta!!translate
[Russian]
"Left Meta"

[MID_KEY_LSUPER]
[English]
Left Windows key
[French]
Left Windows key!!translate
[Russian]
"Left Windows key"

[MID_KEY_RSUPER]
[English]
Right Windows key
[French]
Right Windows key!!translate
[Russian]
"Right Windows key"

[MID_KEY_MODE]
[English]
Alt Gr key
[French]
Alt Gr key!!translate
[Russian]
"Alt Gr key"

[MID_KEY_COMPOSE]
[English]
Multi-key compose key
[French]
Multi-key compose key!!translate
[Russian]
"Multi-key compose key"

[MID_KEY_HELP]
[English]
Help
[French]
Help!!translate
[Russian]
"Помощь"

[MID_KEY_PRINT]
[English]
Print
[French]
Print!!translate
[Russian]
"Печатать"

[MID_KEY_SYSREQ]
[English]
SysReq
[French]
SysReq!!translate
[Russian]
"SysReq"

[MID_KEY_BREAK]
[English]
Break
[French]
Break!!translate
[Russian]
"Break"

[MID_KEY_MENU]
[English]
Menu
[French]
Menu!!translate
[Russian]
"Менью"

[MID_KEY_POWER]
[English]
Power
[French]
Power!!translate
[Russian]
"Power"

[MID_KEY_EURO]
[English]
Euro
[French]
Euro!!translate
[Russian]
"Euro"

[MID_KEY_UNDO]
[English]
Undo
[French]
Undo!!translate
[Russian]
"Undo"